merge parent branch into current one, resolve conflicts
