--- a/README.md
+++ b/README.md
@@ -12,266 +14,86 @@ in AdGuard browser extensions and other projects.
-
-```bash
-pnpm install --shamefully-hoist
+```mermaid
+graph TD
+    css-tokenizer --> agtree
+    css-tokenizer --> tsurlfilter
+    agtree --> tsurlfilter
+    agtree --> tswebextension
+    tsurlfilter --> tswebextension
+    tsurlfilter --> dnr-rulesets
+    logger --> tswebextension
+    logger --> dnr-rulesets
+    tswebextension --> api
+    tswebextension --> api-mv3
 ```
 
-For projects using pnpm, you can use [`pnpm link`][pnpm-link] to connect the packages locally.
-For more details, please check the pnpm documentation.
@@
-
-To summarize the dependency tree, here is a scheme of the dependency tree:
-
-```text
-┌───────────────┐ ┌───────────────┐
-│ css-tokenizer │ │    logger     │
-└──┬────────────┘ └────────────┬──┘
-   │   ┌────────────────┐      │
-   ├──►│     agtree     ├───┐  │
-   │   └────────────────┘   │  │
-   │   ┌────────────────┐   │  │
-   └──►│                │   │  │
-       │  tsurlfilter   │◄──┤  │
-   ┌───┤                │   │  │
-   │   └────────────────┘   │  │
-   │   ┌────────────────┐   │  │
-   │   │                │◄──┘  │
-   ├──►│ tswebextension │◄─────┤
-   │   │                ├───┐  │
-   │   └────────────────┘   │  │
-   │   ┌────────────────┐   │  │
-   └──►│  dnr-rulesets  │◄──┼──┘
-       └────────────────┘   │
-       ┌────────────────┐   │
-       │      api       │◄──┤
-       └────────────────┘   │
-       ┌────────────────┐   │
-       │    api-mv3     │◄──┘
-       └────────────────┘
-```
-
-##### Examples packages
-
